#+TITLE: 自然语言处理 -- 第一课: AI Paradigm

*** 1.3 generative 方式生成语言

1. simple grammar 的处理
   - ~create_grammar(gram, split="|")~ 函数: 生成新的语法数据结构

     #+BEGIN_SRC python
def create_grammar(gram, outer_delimiter="=>", inner_delimiter="|", line_delimiter="\n"):
    grammar = {}
    for line in gram.split(line_delimiter):
        if not line.strip():
            continue
        exp, stmt = line.split(outer_delimiter)
        grammar[exp.split()[0]] = [s.split() for s in stmt.split(inner_delimiter)]
    return grammar
     #+END_SRC
   - ~generate(gram, target)~: 生成新的语句

     #+BEGIN_SRC python
def generate(gram, target):
    if target not in gram: return target
    expand = [generate(gram, t) for t in random.choice(gram[target])]
    return ''.join([e if e != '/n' else '\n' for e in expand if e != "null"])
     #+END_SRC
   - 生成示例语句

     #+BEGIN_SRC python
grammar = create_grammer(simple_grammar)
generate(grammar, "sentence")
     #+END_SRC

2. 西部世界语言生成示例

   #+BEGIN_SRC python
# 人类语言
human = """
human = 自己 寻找 活动
自己 = 我 | 俺 | 我们
寻找 = 看看 | 找找 | 想找点
活动 = 乐子 | 玩的
"""

# 接待员语言
host = """
host = 寒暄 报数 询问 业务相关 结尾
报数 = 我是 数字 号 ，
数字 = 单个数字 | 数字 单个数字
单个数字 = 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9
寒暄 = 称谓 打招呼 | 打招呼
称谓 = 人称 ，
人称 = 先生 | 女士 | 小朋友
打招呼 = 你好， | 您好，
询问 = 请问您要 | 您需要
业务相关 = 玩玩 具体业务
具体业务 = 喝酒 | 打牌 | 打猎 | 赌博
结尾 = 吗？"""

generate(create_grammar("host", "="), target="host")
   #+END_SRC

   #+RESULTS:
   : '您好我是9号，请问您要玩玩赌博吗？'

